Repository: Starciad/PixelDustSandbox
Catalog: src/SS.ContentBundle/Localization/GUIs/SLocalization.GUIs.*.resx
Languages: pt_br

# Menu.Main.Button.Create
source: Create
pt_br: Criar

# Menu.Main.Button.Options
source: Options
pt_br: Opções

# Menu.Main.Button.Credits
source: Credits
pt_br: Créditos

# Menu.Main.Button.Quit
source: Quit
pt_br: Sair

# Menu.Options.Title
source: OPTIONS
pt_br: OPÇÕES

# Menu.Options.Section.General.Name
source: General
pt_br: Geral

# HUD.Button.ItemExplorer.Name
source: Item Explorer
pt_br: Explorador de Itens

# HUD.Button.ItemExplorer.Description
source: A portal to the entire catalog of game elements. Here, you can browse, discover, and learn about each available element, exploring its characteristics, behaviors, and interactions.
pt_br: Um portal para todo o catálogo de elementos do jogo. Aqui, você pode navegar, descobrir e aprender sobre cada elemento disponível, explorando suas características, comportamentos e interações.

# Menu.Options.Section.Video.Name
source: Video
pt_br: Vídeo

# Menu.Credits.Title.Creator
source: Creator
pt_br: Criador

# Menu.Credits.Title.Roles
source: Roles
pt_br: Cargos

# Menu.Credits.Title.Programming
source: Programming
pt_br: Programadores

# Menu.Credits.Title.Artists
source: Artists
pt_br: Artistas

# Menu.Credits.Title.Composers
source: Composers
pt_br: Compositores

# Menu.Credits.Title.Tools
source: Tools
pt_br: Ferramentas

# Menu.Credits.Message.Finalization
source: And that's the end...
pt_br: E esse é o fim...

# Menu.Credits.Message.ThankPlayer
source: Thanks for Playing!
pt_br: Obrigado por Jogar!

# Menu.Credits.People.Parents
source: To my parents.
pt_br: Aos meus pais.

# Menu.Credits.Title.Contributors
source: Contributors
pt_br: Contribuidores

# Menu.Credits.Title.SpecialThanks
source: Special Thanks
pt_br: Agradecimentos Especiais

# Menu.Options.Section.Video.Option.Resolution.Name
source: Resolution
pt_br: Resolução

# Menu.Options.Section.Video.Option.Fullscreen.Name
source: Fullscreen
pt_br: Tela Cheia

# Menu.Options.Section.Video.Option.Borderless.Name
source: Borderless
pt_br: Sem Bordas

# Menu.Main.Button.Play
source: Play
pt_br: Jogar

# HUD.Button.EnvironmentSettings.Name
source: Environment Settings
pt_br: Configurações do Ambiente

# HUD.Button.PenSettings.Name
source: Pen Settings
pt_br: Configurações da Caneta

# HUD.Button.WorldSettings.Name
source: World Settings
pt_br: Configurações do Mundo

# HUD.Button.PauseSimulation.Name
source: Pause/Resume Simulation
pt_br: Pausar/Retomar Simulação

# HUD.Button.GameMenu.Name
source: Game Menu
pt_br: Menu do Jogo

# HUD.Button.SaveMenu.Name
source: Save Menu
pt_br: Menu de Salvamento

# HUD.Button.EraseEverything.Name
source: Erase Everything
pt_br: Apagar Tudo

# HUD.Button.ReloadSimulation.Name
source: Reload Simulation
pt_br: Recarregar Simulação

# HUD.Button.Eraser.Name
source: Eraser
pt_br: Borracha

# HUD.Button.EraseEverything.Description
source: Clears all content from the map, including elements, entities, and decorations, restoring it to an empty initial state.
pt_br: Apaga todos os conteúdos presentes no mapa, incluindo elementos, entidades e decorações, retornando ao estado inicial vazio.

# HUD.Button.GameMenu.Description
source: Opens the game's main menu to access settings and other options.
pt_br: Abre o menu principal do jogo para acessar configurações e outras opções.

# HUD.Button.PauseSimulation.Description
source: Pauses or resumes the ongoing simulation.
pt_br: Pausa ou retoma a simulação em andamento.

# HUD.Button.PenSettings.Description
source: Adjusts the pen settings, modifying how it interacts with the world's canvas.
pt_br: Ajusta as configurações da caneta, alterando como ela interage com o canvas do mundo.

# HUD.Button.ReloadSimulation.Description
source: Reloads a previously loaded simulation, reverting any changes made. If no simulation is loaded, clears the map, leaving the canvas empty.
pt_br: Reinicia uma simulação carregada, revertendo alterações feitas. Caso nenhuma simulação esteja carregada, limpa o mapa, deixando o canvas vazio.

# HUD.Button.SaveMenu.Description
source: Opens the menu to manage simulation and world saving.
pt_br: Abre o menu para gerenciar o salvamento de simulações e mundos.

# HUD.Button.WorldSettings.Description
source: Adjusts general and systematic settings for the world.
pt_br: Ajusta configurações gerais e sistemáticas do mundo.

# HUD.Button.EnvironmentSettings.Description
source: Modifies the world's environmental properties, including weather, temperature, and other factors.
pt_br: Altera características ambientais do mundo, como clima, temperatura e outros fatores.

# HUD.Button.Eraser.Description
source: Turns the current pen into an eraser, allowing you to directly remove content from the canvas.
pt_br: Transforma a caneta atual em um apagador, permitindo remover conteúdos diretamente do canvas.

# HUD.Complements.PenSettings.Section.Layer.Button.Front.Name
source: Foreground
pt_br: Camada Frontal

# HUD.Complements.PenSettings.Section.Layer.Button.Back.Name
source: Background Layer
pt_br: Camda Traseira

# HUD.Complements.PenSettings.Section.Shape.Button.Circle.Name
source: Circle Shape
pt_br: Formato Círcular

# HUD.Complements.PenSettings.Section.Shape.Button.Square.Name
source: Square Shape
pt_br: Formato de Quadrado

# HUD.Complements.PenSettings.Section.Shape.Button.Triangle.Name
source: Triangle Shape
pt_br: Formato Triângular

# HUD.Complements.PenSettings.Title
source: Pen Settings
pt_br: Configurações da Caneta

# HUD.Complements.PenSettings.Section.BrushSize.Title
source: Brush Size
pt_br: Tamanho do Pincel

# HUD.Complements.PenSettings.Section.BrushSize.Button.Slider.Name
source: Brush Size
pt_br: Tamanho do Pincel

# HUD.Complements.PenSettings.Section.BrushSize.Button.Slider.Description
source: Brush size is set to {0}.
pt_br: O tamanho do pincel é definido como {0}.

# HUD.Complements.PenSettings.Section.Tool.Title
source: Tool
pt_br: Ferramenta

# HUD.Complements.PenSettings.Section.Layer.Title
source: Layer
pt_br: Camada

# HUD.Complements.PenSettings.Section.Shape.Title
source: Shape
pt_br: Formato

# HUD.Complements.PenSettings.Section.Layer.Button.Back.Description
source: The back layer of the world is used for item placement.
pt_br: A camada traseira do mundo é usada para posicionamento de itens.

# HUD.Complements.PenSettings.Section.Layer.Button.Front.Description
source: The front layer of the world is used for item placement.
pt_br: A camada frontal do mundo é usada para posicionamento de itens.

# HUD.Complements.PenSettings.Section.Shape.Button.Circle.Description
source: The pen shape becomes a circle.
pt_br: O formato da caneta se torna um círculo.

# HUD.Complements.PenSettings.Section.Shape.Button.Square.Description
source: The pen shape becomes a square.
pt_br: O formato da caneta se torna um quadrado.

# HUD.Complements.PenSettings.Section.Shape.Button.Triangle.Description
source: The pen shape becomes a triangle.
pt_br: O formato da caneta se torna um triângulo.

# Button.Exit.Description
source: Closes the current menu.
pt_br: Fecha o menu atual.

# HUD.Complements.SaveSettings.Title
source: Save Settings
pt_br: Configurações de Salvamento

# HUD.Complements.SaveSettings.Section.Name.Title
source: Name
pt_br: Nome

# HUD.Complements.SaveSettings.Section.Description.Title
source: Description
pt_br: Descrição

# HUD.Complements.SaveSettings.Section.Thumbnail.Title
source: Thumbnail
pt_br: Miniatura

# HUD.Complements.SaveSettings.Button.Save.Description
source: Saves the current state of the world to a file on the computer for later access. If a file with the specified name already exists, it will be overwritten with the current world's data.
pt_br: Salva o estado atual do mundo em um arquivo no computador, permitindo acesso posterior. Se o nome especificado já existir, o arquivo correspondente será sobrescrito com as informações do mundo atual.

# HUD.Button.Information.Name
source: Information
pt_br: Informações

# HUD.Button.Information.Description
source: View general information and statistics related to your world.
pt_br: Veja informações gerais e estatísticas relacionadas ao seu mundo.

# HUD.Complements.Information.Title
source: Information
pt_br: Informações

# HUD.Complements.Information.Field.ForegroundElements
source: Foreground Elements
pt_br: Elementos no Primeiro Plano

# HUD.Complements.Information.Field.BackgroundElements
source: Background Elements
pt_br: Elementos no Plano de Fundo

# HUD.Complements.EnvironmentSettings.Title
source: Environment Settings
pt_br: Configurações do Ambiente

# HUD.Complements.EnvironmentSettings.Section.TimeState.Title
source: State
pt_br: Estado

# HUD.Complements.EnvironmentSettings.Section.Time.Title
source: Time
pt_br: Horário

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Midnight.Title
source: Midnight
pt_br: Meia-noite

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Dawn.Title
source: Dawn
pt_br: Amanhecer

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Morning.Title
source: Morning
pt_br: Manhã

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Noon.Title
source: Noon
pt_br: Meio-dia

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Afternoon.Title
source: Afternoon
pt_br: Tarde

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Dusk.Title
source: Dusk
pt_br: Anoitecer

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Evening.Title
source: Evening
pt_br: Noite

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Afternoon.Description
source: Jump to afternoon (03:00 PM).
pt_br: Ir para a tarde (15:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Dawn.Description
source: Jump to dawn (06:00 AM).
pt_br: Ir para o amanhecer (06:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Dusk.Description
source: Jump to dusk (06:00 PM).
pt_br: Ir para o anoitecer (18:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Evening.Description
source: Jump to evening (09:00 PM).
pt_br: Ir para a noite (21:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Midnight.Description
source: Jump to midnight (00:00).
pt_br: Ir para meia-noite (00:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Morning.Description
source: Jump to morning (09:00 AM).
pt_br: Ir para a manhã (09:00).

# HUD.Complements.EnvironmentSettings.Section.Time.Button.Noon.Description
source: Jump to noon (12:00 PM).
pt_br: Ir para o meio-dia (12:00).

# HUD.Complements.EnvironmentSettings.Section.TimeState.Button.Disable.Description
source: Disable the time progression, freezing the current time.
pt_br: Desabilita a progressão do tempo, congelando o tempo atual.

# HUD.Complements.EnvironmentSettings.Section.TimeState.Button.Enable.Description
source: Enable the time progression, resuming the natural time flow.
pt_br: Habilite a progressão do tempo, retomando o fluxo natural do tempo.

# HUD.Complements.WorldSettings.Section.Size.Button.Small.Name
source: Small
pt_br: Pequeno

# HUD.Complements.WorldSettings.Section.Size.Button.MediumSmall.Name
source: Medium Small
pt_br: Médio-Pequeno

# HUD.Complements.WorldSettings.Section.Size.Button.Medium.Name
source: Medium
pt_br: Médio

# HUD.Complements.WorldSettings.Section.Size.Button.MediumLarge.Name
source: Medium Large
pt_br: Médio-Grande

# HUD.Complements.WorldSettings.Section.Size.Button.Large.Name
source: Large
pt_br: Grande

# HUD.Complements.WorldSettings.Section.Size.Button.VeryLarge.Name
source: Very Large
pt_br: Muito Grande

# HUD.Complements.WorldSettings.Section.Size.Button.Large.Description
source: The size of the world will have the dimensions 240x138 - Designed for expansive gameplay areas. May impact performance on lower-end systems.
pt_br: O tamanho do mundo terá as dimensões 240x138 - Projetado para áreas de jogo expansivas. Pode impactar o desempenho em sistemas de menor desempenho.

# HUD.Complements.WorldSettings.Section.Size.Button.MediumLarge.Description
source: The size of the world will have the dimensions 160x92 - Provides ample space for exploration.
pt_br: O tamanho do mundo terá as dimensões 160x92 - Oferece bastante espaço para exploração.

# HUD.Complements.WorldSettings.Section.Size.Button.Small.Description
source: The size of the world will have the dimensions 40x23 - Fits entirely within the player's camera.
pt_br: O tamanho do mundo terá as dimensões 40x23 - Cabe inteiramente dentro da câmera do jogador.

# HUD.Complements.WorldSettings.Section.Size.Button.VeryLarge.Description
source: The size of the world will have the dimensions 320x184 - Best for epic-scale worlds. May impact performance on lower-end systems.
pt_br: O tamanho do mundo terá as dimensões 320x184 - Melhor para mundos de escala épica. Pode impactar o desempenho em sistemas de menor desempenho.

# HUD.Complements.WorldSettings.Section.Size.Title
source: Sizes
pt_br: Tamanhos

# HUD.Complements.WorldSettings.Title
source: World Settings
pt_br: Configurações do Mundo

# HUD.Complements.WorldSettings.Section.Size.Button.MediumSmall.Description
source: The size of the world will have the dimensions 80x46 - Allows limited free movement.
pt_br: O tamanho do mundo terá as dimensões 80x46 - Permite movimentação limitada.

# HUD.Complements.WorldSettings.Section.Size.Button.Medium.Description
source: The size of the world will have the dimensions 120x69 - Balanced for most gameplay scenarios.
pt_br: O tamanho do mundo terá as dimensões 120x69 - Balanceado para a maioria dos cenários de jogo.

# HUD.Complements.ItemExplorer.Title
source: Item Explorer
pt_br: Explorador de Itens

# HUD.Button.Speed.Name
source: Simulation Speed
pt_br: Velocidade da Simulação

# HUD.Button.Speed.Description
source: Adjusts the temporal flow speed of various simulation components, including element interactions, time progression, and related aspects. Higher speeds may cause minor performance slowdowns due to increased processing demand.
pt_br: Ajusta a velocidade do fluxo temporal de vários componentes da simulação, incluindo a interação entre elementos, o avanço do tempo e outros aspectos relacionados. Velocidades mais altas podem ocasionar pequenos gargalos no desempenho do jogo devido ao aumento na carga de processamento.

# HUD.Complements.Pause.Title
source: Pause
pt_br: Pausa

# Menu.Credits.Title.Testers
source: Testers
pt_br: Testadores

# Menu.Options.Section.Gameplay.Name
source: Gameplay
pt_br: Jogabilidade

# Menu.Options.Section.Graphics.Name
source: Graphics
pt_br: Gráficos

# Menu.Options.Section.General.Option.Language.Name
source: Language
pt_br: Idioma

# Menu.Options.Section.Gameplay.Option.PreviewAreaColor.Name
source: Preview Area Color
pt_br: Cor da Área

# Menu.Options.Section.Gameplay.Option.PreviewAreaOpacity.Name
source: Preview Area Opacity
pt_br: Opacidade da Área

# Menu.Options.Section.Volume.Option.MasterVolume.Name
source: Master Volume
pt_br: Volume Geral

# Menu.Options.Section.Volume.Option.MusicVolume.Name
source: Music Volume
pt_br: Volume da Música

# Menu.Options.Section.Volume.Option.SFXVolume.Name
source: SFX Volume
pt_br: Volume dos SFX

# Menu.Options.Section.Graphics.Option.Lighting.Name
source: Lighting
pt_br: Iluminação

# Menu.Options.Section.Cursor.Option.Color.Name
source: Color
pt_br: Cor

# Menu.Options.Section.Cursor.Option.BackgroundColor.Name
source: Background Color
pt_br: Cor de Fundo

# Menu.Options.Section.Cursor.Option.Scale.Name
source: Scale
pt_br: Escala

# Menu.Options.Section.Cursor.Option.Opacity.Name
source: Opacity
pt_br: Opacidade

# Menu.Options.Section.General.Description
source: Basic game settings, including language and accessibility.
pt_br: Configurações básicas do jogo, incluindo idioma e acessibilidade.

# Menu.Options.Section.Gameplay.Description
source: Adjust gameplay-related preferences.
pt_br: Ajuste preferências relacionadas à jogabilidade.

# Menu.Options.Section.Volume.Description
source: Control audio levels for different categories.
pt_br: Controle os níveis de áudio para diferentes categorias.

# Menu.Options.Section.Video.Description
source: Modify video-related settings, including resolution and display modes.
pt_br: Modifique as configurações relacionadas ao vídeo, incluindo resolução e modos de exibição.

# Menu.Options.Section.Graphics.Description
source: Configure graphical settings for visual quality.
pt_br: Configure as configurações gráficas para qualidade visual.

# Menu.Options.Section.Cursor.Description
source: Customize the appearance and behavior of the mouse cursor.
pt_br: Personalize a aparência e o comportamento do cursor do mouse.

# Menu.Options.Section.Volume.Option.SFXVolume.Description
source: Adjust the sound effects volume.
pt_br: Ajuste o volume dos efeitos sonoros.

# Menu.Options.Section.Volume.Option.MusicVolume.Description
source: Set the volume for background music.
pt_br: Defina o volume para a música de fundo.

# Menu.Options.Section.Volume.Option.MasterVolume.Description
source: Adjust the overall game volume.
pt_br: Ajuste o volume geral do jogo.

# Menu.Options.Section.Video.Option.VSync.Description
source: Turn vertical synchronization on or off to avoid screen tearing.
pt_br: Ative ou desative a sincronização vertical para evitar cortes na tela.

# Menu.Options.Section.Video.Option.Resolution.Description
source: Select the screen resolution for the game.
pt_br: Selecione a resolução de tela para o jogo.

# Menu.Options.Section.Video.Option.Fullscreen.Description
source: Enable or disable fullscreen mode.
pt_br: Ative ou desative o modo de tela cheia.

# Menu.Options.Section.Video.Option.Borderless.Description
source: Enable borderless windowed mode.
pt_br: Ative o modo janela sem bordas.

# Menu.Options.Section.Graphics.Option.Lighting.Description
source: Enable or disable advanced lighting effects.
pt_br: Ative ou desative os efeitos avançados de iluminação.

# Menu.Options.Section.Cursor.Option.Scale.Description
source: Adjust the size of the cursor.
pt_br: Ajuste o tamanho do cursor.

# Menu.Options.Section.Cursor.Option.Opacity.Description
source: Set the transparency level of the cursor.
pt_br: Defina o nível de transparência do cursor.

# Menu.Options.Section.Cursor.Option.Color.Description
source: Set the color of the cursor.
pt_br: Defina a cor do cursor.

# Menu.Options.Section.Cursor.Option.BackgroundColor.Description
source: Set the background color of the cursor.
pt_br: Defina a cor de fundo do cursor.

# Menu.Options.Section.Gameplay.Option.PreviewAreaOpacity.Description
source: Set the transparency level of the preview area.
pt_br: Defina o nível de transparência da área de pré-visualização.

# Menu.Options.Section.Gameplay.Option.PreviewAreaColor.Description
source: Choose the color for the preview area displayed during gameplay.
pt_br: Escolha a cor para a área de pré-visualização exibida durante o jogo.

# Menu.Options.Section.General.Option.Language.Description
source: Select the language for the game interface.
pt_br: Selecione o idioma para a interface do jogo.

# Menu.Options.Button.Save.Description
source: Saves and applies all modified options.
pt_br: Salva e aplica todas as opções modificadas.
